[net]
# Network Dimensions
width=512
height=512
channels=3

# Optimization Parameters
batch=64
subdivisions=16
decay=0.0005
learning_rate=0.0005
momentum=0.9
burn_in=2000
max_batches=50000
policy=steps
steps=40000,45000
scales=0.1,0.1


# Image Augementation Parameters
hue=0.1
saturation=1.5
exposure=1.5
angle=0

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=64
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=64
activation=leaky

[maxpool]
size=2
stride=2
padding=0

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=leaky

[maxpool]
size=2
stride=2
padding=0

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[maxpool]
size=2
stride=2
padding=0

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[maxpool]
size=2
stride=2
padding=0

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[maxpool]
size=3
stride=1
padding=1

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=1024
activation=leaky

[route]
layers=-8

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=leaky

[route]
layers=-11

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=leaky

[route]
layers=-15

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=leaky

[route]
layers=-19

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=leaky

[route]
layers=-1, -6, -10, -14

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=512
activation=leaky

[route]
layers=-26

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=512
activation=leaky

[shortcut]
from=-3
activation=Activations.LINEAR

[route]
layers=-22

[convolutional]
batch_normalize=1
size=1
stride=2
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[route]
layers=-25

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[route]
layers=-29

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=192
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[route]
layers=-1, -6, -10

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=1024
activation=leaky

[route]
layers=-36

[convolutional]
batch_normalize=1
size=1
stride=2
pad=1
filters=1024
activation=leaky

[shortcut]
from=-3
activation=Activations.LINEAR

[convolutional]
batch_normalize=1
size=1
stride=2
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[route]
layers=-3

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[route]
layers=-7

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=192
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[route]
layers=-1, -6, -10

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=512
activation=leaky

[route]
layers=-14

[convolutional]
batch_normalize=1
size=1
stride=2
pad=1
filters=512
activation=leaky

[shortcut]
from=-3
activation=Activations.LINEAR

[convolutional]
batch_normalize=1
size=1
stride=2
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=leaky

[route]
layers=-3

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=64
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=leaky

[route]
layers=-7

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=64
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=96
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=leaky

[route]
layers=-1, -6, -10

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=256
activation=leaky

[route]
layers=-14

[convolutional]
batch_normalize=1
size=1
stride=2
pad=1
filters=256
activation=leaky

[shortcut]
from=-3
activation=Activations.LINEAR

[convolutional]
batch_normalize=1
size=1
stride=2
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=leaky

[route]
layers=-3

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=64
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=leaky

[route]
layers=-7

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=64
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=96
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=leaky

[route]
layers=-1, -6, -10

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=256
activation=leaky

[route]
layers=-14

[convolutional]
batch_normalize=1
size=1
stride=2
pad=1
filters=256
activation=leaky

[shortcut]
from=-3
activation=Activations.LINEAR

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=18
activation=leaky

[yolo]
mask=12,13,14
anchors=12,16,19,36,40,28,36,75,76,55,72,146,142,110,192,243,459,401
classes=1
num=9
jitter=0.5
ignore_thresh=0.5
truth_thresh=1.0
random=1
[route]
layers=-23

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=18
activation=leaky

[yolo]
mask=9,10,11
anchors=12,16,19,36,40,28,36,75,76,55,72,146,142,110,192,243,459,401
classes=1
num=9
jitter=0.5
ignore_thresh=0.5
truth_thresh=1.0
random=1
[route]
layers=-46

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=18
activation=leaky

[yolo]
mask=6,7,8
anchors=12,16,19,36,40,28,36,75,76,55,72,146,142,110,192,243,459,401
classes=1
num=9
jitter=0.5
ignore_thresh=0.5
truth_thresh=1.0
random=1
[route]
layers=-69

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=18
activation=leaky

[yolo]
mask=3,4,5
anchors=12,16,19,36,40,28,36,75,76,55,72,146,142,110,192,243,459,401
classes=1
num=9
jitter=0.5
ignore_thresh=0.5
truth_thresh=1.0
random=1
[route]
layers=-93

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=18
activation=leaky

[yolo]
mask=0,1,2
anchors=12,16,19,36,40,28,36,75,76,55,72,146,142,110,192,243,459,401
classes=1
num=9
jitter=0.5
ignore_thresh=0.5
truth_thresh=1.0
random=1
